#  TMDB SQL Analysis — ALX Data Science Supplementary Exam

**Author:** Stephen Otieno (Salim)  
**Database:** The Movie Database (TMDb)  
**Date:** November 2025  


##  Overview

This notebook explores *The Movie Database (TMDb)* — an online movie and TV show database supporting 39 languages and operating in over 180 countries.  
The dataset consists of **12 interconnected tables**, covering movies, genres, casts, production companies, and more.

We will use **SQLite** within Jupyter Notebook via the `%sql` magic command to answer SQL-based analytical questions.  
Each question is clearly documented, with its corresponding SQL query and explanation.

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///TMDB-a-4006.db

'Connected: @TMDB-a-4006.db'

##  Question 1
**Who won the Oscar for “Actor in a Leading Role” in 2015?**

*Hint:* The winner is indicated as `1.0`.

**Options:**
- Michael Fassbender  
- Natalie Portman  
- Leonardo DiCaprio  
- Eddie Redmayne

In [37]:
%%sql

SELECT name, film
FROM Oscars
WHERE award = 'Actor in a Leading Role'
  AND winner = '1.0'
  AND year = '2015';

 * sqlite:///TMDB-a-4006.db
Done.

[('Leonardo DiCaprio', 'The Revenant')]

##  Question 2
**What query will produce the ten oldest movies in the database?**

In [7]:
%%sql

SELECT * 
FROM movies 
WHERE release_date IS NOT NULL 
ORDER BY release_date ASC 
LIMIT 10;

 * sqlite:///TMDB-a-4006.db
Done.

[(3059, 'Intolerance', '1916-09-04 00:00:00.000000', 385907, None, 'en', 'Intolerance', 'The story of a poor young woman, separated by prejudice from her husband and baby, is interwoven with tales of intolerance from throughout history.', 3.232447, 8394751.0, 197.0, 'Released', 'The Cruel Hand of Intolerance', 7.4, 60),
 (3060, 'The Big Parade', '1925-11-05 00:00:00.000000', 245000, None, 'en', 'The Big Parade', "The story of an idle rich boy who joins the US Army's Rainbow Division and is sent to France to fight in World War I, becomes friends with two working class men, experiences the horrors of trench warfare, and finds love with a French girl.", 0.785744, 22000000.0, 151.0, 'Released', None, 7.0, 21),
 (19, 'Metropolis', '1927-01-10 00:00:00.000000', 92620000, None, 'de', 'Metropolis', "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.", 32.351527, 650422.0, 153.0, 'Released', 'There can be no understanding between the hands and the brain unless the heart acts as mediator.', 8.0, 657),
 (905, "Pandora's Box", '1929-01-30 00:00:00.000000', 0, None, 'de', 'Die Bnchse der Pandora', 'The rise and inevitable fall of an amoral but naive young woman whose insouciant eroticism inspires lust and violence in those around her.', 1.824184, 0.0, 109.0, 'Released', None, 7.6, 45),
 (65203, 'The Broadway Melody', '1929-02-08 00:00:00.000000', 379000, None, 'en', 'The Broadway Melody', "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield' ... (195 characters truncated) ... eenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie", 0.968865, 4358000.0, 100.0, 'Released', "The pulsating drama of Broadway's bared heart speaks and sings with a voice to stir your soul!", 5.0, 19),
 (22301, "Hell's Angels", '1930-11-15 00:00:00.000000', 3950000, None, 'en', "Hell's Angels", "Two brothers attending Oxford enlist with the Royal Flying Corps when World War I breaks out. Roy and Monte Rutledge have very different personalitie ... (576 characters truncated) ... t a strategic German munitions facility is a booming success, but with a squadron of fighters bearing down on them afterwards, escape seems unlikely.", 8.484123, 8000000.0, 127.0, 'Released', "Howard Hughes' Thrilling Multi-Million Dollar Air Spectacle", 6.1, 19),
 (22649, 'A Farewell to Arms', '1932-12-08 00:00:00.000000', 4, None, 'en', 'A Farewell to Arms', "British nurse Catherine Barkley (Helen Hayes) and American Lieutenant Frederic Henry (Gary Cooper) fall in love during the First World War in Italy.  ... (105 characters truncated) ... the war rages on. Academy Awards winner for Best Cinematography and for Best Sound, Recording. Nominated for Best Picture and for Best Art Direction.", 1.199451, 25.0, 89.0, 'Released', 'Every woman who has loved will understand', 6.2, 28),
 (3062, '42nd Street', '1933-02-02 00:00:00.000000', 439000, None, 'en', '42nd Street', 'A producer puts on what may be his last Broadway show, and at the last moment a chorus girl has to replace the star.', 1.933366, 2281000.0, 89.0, 'Released', None, 6.1, 37),
 (43595, 'She Done Him Wrong', '1933-02-09 00:00:00.000000', 200000, None, 'en', 'She Done Him Wrong', '"New York singer and nightclub owner Lady Lou has more men friends than you can imagine. Unfortunately one of them is a vicious criminal who\'s escap ... (52 characters truncated) ... ing she hasn\'t exactly been faithful in his absence. Help is at hand in the form of young Captain Cummings a local temperance league leader though."', 0.622752, 2200000.0, 66.0, 'Released', "Mae West gives a 'Hot Time' to the nation!", 5.1, 27),
 (3078, 'It Happened One Night', '1934-02-22 00:00:00.000000', 325000, None, 'en', 'It Happened One Night', "Ellie Andrews has just tied the knot with society aviator King Westley when she is whisked away to her father's yacht and out of King's clutches. Ell ... (233 characters truncated) ... ts her back to her husband, or he'll blow the whistle on Ellie to her father. Either way, Peter gets what he wants... a really juicy newspaper story!", 11.871424, 4500000.0, 105.0, 'Released', 'TOGETHER... for the first time', 7.7, 275)]

##  Question 3
**How many unique awards are there in the Oscars table?**

In [38]:
%%sql

SELECT COUNT(DISTINCT award) AS unique_awards
FROM Oscars;

 * sqlite:///TMDB-a-4006.db
Done.

[(114,)]

##  Question 4
**How many movies contain the word “Spider” in their title?**

In [10]:
%%sql

SELECT COUNT(*) AS spider_movies 
FROM movies 
WHERE title LIKE '%Spider%';

 * sqlite:///TMDB-a-4006.db
Done.

[(9,)]

##  Question 5
**How many movies are both in the “Thriller” genre and contain the word “love” in the keywords?**

In [13]:
%%sql
SELECT COUNT(DISTINCT m.movie_id) AS thriller_love_movies
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND LOWER(k.keyword_name) LIKE '%love%';

 * sqlite:///TMDB-a-4006.db
Done.

[(48,)]

##  Question 6
**Movies released between 2006-08-01 and 2009-10-01 with popularity > 40 and budget < 50,000,000**

In [14]:
%%sql

SELECT COUNT(*) AS movie_count
FROM movies
WHERE release_date BETWEEN '2006-08-01' AND '2009-10-01'
  AND popularity > 40
  AND budget < 50000000;

 * sqlite:///TMDB-a-4006.db
Done.

[(29,)]

##  Question 7
**How many unique characters has “Vin Diesel” played so far?**

In [20]:
%%sql

SELECT COUNT(DISTINCT c.characters) AS unique_characters
FROM casts c
JOIN actors a ON c.actor_id = a.actor_id
WHERE a.actor_name = 'Vin Diesel';

 * sqlite:///TMDB-a-4006.db
Done.

[(16,)]

##  Question 8
**What are the genres of the movie “The Royal Tenenbaums”?**

In [17]:
%%sql

SELECT g.genre_name
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
WHERE m.title = 'The Royal Tenenbaums';

 * sqlite:///TMDB-a-4006.db
Done.

[('Drama',), ('Comedy',)]

##  Question 9
**Top 3 production companies with the highest average movie popularity**

In [22]:
%%sql

SELECT pc.production_company_name, 
       AVG(m.popularity) AS avg_popularity
FROM movies m
JOIN productioncompanymap pcm ON m.movie_id = pcm.movie_id
JOIN productioncompanies pc ON pcm.production_company_id = pc.production_company_id
GROUP BY pc.production_company_name
ORDER BY avg_popularity DESC
LIMIT 3;

 * sqlite:///TMDB-a-4006.db
Done.

[("The Donners' Company", 514.569956),
 ('Bulletproof Cupid', 481.098624),
 ('Kinberg Genre', 326.92099900000005)]

##  Question 10
**How many female actors (gender = 1) have names starting with “N”?**

In [23]:
%%sql

SELECT COUNT(*) AS female_n_names
FROM Actors
WHERE gender = 1
  AND actor_name LIKE 'N%';

 * sqlite:///TMDB-a-4006.db
Done.

[(355,)]

##  Question 11
**Which genre has, on average, the lowest movie popularity score?**

In [25]:
%%sql

SELECT g.genre_name, AVG(m.popularity) AS avg_popularity
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
GROUP BY g.genre_name
ORDER BY avg_popularity ASC
LIMIT 1;

 * sqlite:///TMDB-a-4006.db
Done.

[('Foreign', 0.686786794117647)]

##  Question 12
**Which award category has the highest number of actor nominations?**

*(Hint: Oscars.name contains both actors' names and film names.)*

In [27]:
%%sql

SELECT award AS category, COUNT(*) AS total_nominations
FROM Oscars
WHERE name IN (SELECT actor_name FROM Actors)
GROUP BY award
ORDER BY total_nominations DESC
LIMIT 1;

 * sqlite:///TMDB-a-4006.db
Done.

[('Actor in a Supporting Role', 350)]

##  Question 13
**Normalize year format (keep only the second indicated year)**

In [28]:
%%sql

UPDATE Oscars
SET year = substr(year, -4);

 * sqlite:///TMDB-a-4006.db
9964 rows affected.

[]

##  Question 14
**Create a view of all movies featuring Alan Rickman**

In [33]:
%%sql

DROP VIEW IF EXISTS Alan_Rickman_Movies;

CREATE VIEW Alan_Rickman_Movies AS
SELECT m.title, m.release_date, m.tagline, m.overview
FROM movies m
LEFT JOIN casts c ON c.movie_id = m.movie_id
LEFT JOIN actors a ON c.actor_id = a.actor_id
WHERE a.actor_name = 'Alan Rickman';

 * sqlite:///TMDB-a-4006.db
Done.
Done.

[]

In [35]:
%%sql
SELECT * FROM Alan_Rickman_Movies
limit 5;

 * sqlite:///TMDB-a-4006.db
Done.

[('Love Actually', '2003-09-07 00:00:00.000000', 'The ultimate romantic comedy.', 'Follows seemingly unrelated people as their lives begin to intertwine while they fall in û and out û of love. Affections languish and develop as Christmas draws near.'),
 ('Die Hard', '1988-07-15 00:00:00.000000', '40 Stories. Twelve Terrorists. One Cop.', "NYPD cop, John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when minutes after he arrives at her office, the enti ... (31 characters truncated) ... roup of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down."),
 ("Harry Potter and the Philosopher's Stone", '2001-11-16 00:00:00.000000', 'Let the Magic Begin.', "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- w ... (114 characters truncated) ... d powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths -- and about the villain who's to blame."),
 ('Harry Potter and the Chamber of Secrets', '2002-11-13 00:00:00.000000', 'Hogwarts is back in session.', 'Ignoring threats to his life, Harry returns to Hogwarts to investigate û aided by Ron and Hermione û a mysterious series of attacks.'),
 ('Harry Potter and the Prisoner of Azkaban', '2004-05-31 00:00:00.000000', 'Something wicked this way comes.', 'Harry, Ron and Hermione return to Hogwarts for another magic-filled year. Harry comes face to face with danger yet again, this time in the form of escaped convict, Sirius Black û and turns to sympathetic Professor Lupin for help.')]

##  Question 15
**Which of the following statements about database normalisation are true?**

### Statements:
i) Database normalisation improves data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.  
ii) Database normalisation supports up to the Third Normal Form and removes all data anomalies.  
iii) Database normalisation removes inconsistencies that may cause the analysis of our data to be more complicated.  
iv) Database normalisation increases data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

 **Correct Answer:** (i) and (iii)

##  Summary

This notebook demonstrates:
- SQL proficiency using SQLite and `%sql` magic commands.  
- Clean, readable query documentation and result interpretation.  
- Professional data workflow presentation — ideal for collaboration, reference, and portfolio display.

> *“Data is only powerful when it’s structured, queried, and understood.” — Stephen Otieno (Salim)*